wisteria-1c/Конфигурация/Catalogs/ВидыАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыАлкогольнойПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваровИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonForms/ПодборИзКлассификатораВидовПродукцииЕГАИС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Заголовок = Метаданные.Справочники.ВидыАлкогольнойПродукции.Синоним;
	ЗакрыватьПриВыборе = Ложь;
	
	ЗаполнитьКлассификатор();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификатор

&НаКлиенте
Процедура КлассификаторВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавленыНовыеЭлементыКлассификатора = Ложь;
	ВыбранныйЭлемент = КлассификаторВыборНаСервере(Значение, ДобавленыНовыеЭлементыКлассификатора);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ОповеститьФормуИПользователяИЗакрыть(ВыбранныйЭлемент, ДобавленыНовыеЭлементыКлассификатора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьФормуИПользователяИЗакрыть(ВыбранныйЭлемент, ДобавленыНовыеЭлементыКлассификатора = Ложь)
	
	Если ДобавленыНовыеЭлементыКлассификатора Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.ВидыАлкогольнойПродукции"));
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Сохранение'"),
			,
			Заголовок,
			БиблиотекаКартинок.Информация32ГосИС);
	КонецЕсли;
	
	ОповеститьОВыборе(ВыбранныйЭлемент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРанееДобавленныеЭлементы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.Код КАК Код,
	|	ВидыАлкогольнойПродукции.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКлассификатор()
	
	Классификатор.Очистить();
	
	// Получаем полную таблицу элементов классификатора
	// в таблице содержатся Код, Наименование, Маркируемый.
	ТаблицаКлассификатора = РегистрыСведений.ВидыАлкогольнойПродукцииЕГАИС.ВидыАлкогольнойПродукции();
	
	// Получаем таблицу элементов классификатора уже имеющихся в справочнике
	РанееДобавленныеЭлементыКлассификатора = ПолучитьРанееДобавленныеЭлементы();
	РанееДобавленныеЭлементыКлассификатора.Индексы.Добавить("Код");
	
	// Инициализируем структуру которую будем использовать для поиска существующих элементов.
	СтруктураПоискаРанееСозданных = Новый Структура();
	
	Для Каждого СтрокаТаблицы Из ТаблицаКлассификатора Цикл
		
		НоваяСтрока = Классификатор.Добавить();
		НоваяСтрока.Код                    = СтрокаТаблицы.Код;
		НоваяСтрока.Маркируемый            = СтрокаТаблицы.Маркируемый;
		НоваяСтрока.Наименование           = СтрокаТаблицы.Наименование;
		НоваяСтрока.ВидЛицензии            = СтрокаТаблицы.ВидЛицензии;
		НоваяСтрока.ВидПодакцизногоТовара  = СтрокаТаблицы.ВидПодакцизногоТовара;
		
		СтруктураПоискаРанееСозданных.Вставить("Код", СтрокаТаблицы.Код);
		НайденныйЭлемент = РанееДобавленныеЭлементыКлассификатора.НайтиСтроки(СтруктураПоискаРанееСозданных);
		
		Если НайденныйЭлемент.Количество() > 0 Тогда
			НоваяСтрока.Ссылка = НайденныйЭлемент[0].Ссылка;
			НоваяСтрока.ЕстьСсылка = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Классификатор.Сортировать("Наименование");
	
КонецПроцедуры

&НаСервере
Функция КлассификаторВыборНаСервере(Знач ВыбранныеСтроки, ДобавленыНовыеЭлементыКлассификатора = Ложь)

	МассивСсылок = Новый Массив();
	
	Если ТипЗнч(ВыбранныеСтроки) = тип("Массив") Тогда
		
		Для Каждого ИдентификаторСтроки Из ВыбранныеСтроки Цикл
			
			Элемент = Классификатор.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			ДобавитьЭлементКлассификатора(Элемент, Элемент.Ссылка);
			ДобавленыНовыеЭлементыКлассификатора = Истина;
			
			МассивСсылок.Добавить(Элемент.Ссылка);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранныеСтроки) = тип("Число") Тогда
		
		Элемент = Классификатор.НайтиПоИдентификатору(ВыбранныеСтроки);
		
		ДобавитьЭлементКлассификатора(Элемент, Элемент.Ссылка);
		ДобавленыНовыеЭлементыКлассификатора = Истина;
		
		МассивСсылок.Добавить(Элемент.Ссылка);
		
	КонецЕсли;

	Возврат МассивСсылок;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементКлассификатора(ВыбраннаяСтрока, СсылкаНаЭлемент = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СсылкаНаЭлемент = Неопределено Тогда
		ЭлементКлассификатора = Справочники.ВидыАлкогольнойПродукции.СоздатьЭлемент();
	Иначе
		ЭлементКлассификатора = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли;
	
	ЭлементКлассификатора.Заполнить(Неопределено);
	
	ЗаполнитьЗначенияСвойств(ЭлементКлассификатора, ВыбраннаяСтрока);
	ЭлементКлассификатора.Записать();
	
	ВыбраннаяСтрока.Ссылка = ЭлементКлассификатора.Ссылка;
	ВыбраннаяСтрока.ЕстьСсылка = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗагруженные(Команда)
	
	ОтборВключен= Не ОтборВключен;
	Если ОтборВключен Тогда
		Элементы.Классификатор.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьСсылка", 0);
		Элементы.ФормаОтборЗагруженные.Заголовок = Нстр("ru = 'Показать все'");
	Иначе
		Элементы.Классификатор.ОтборСтрок = Неопределено;
		Элементы.ФормаОтборЗагруженные.Заголовок = Нстр("ru = 'Скрыть загруженные'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
